import emoji

def transliterate(name):
    """
    Автор: LarsKort
    Дата: 16/07/2011; 1:05 GMT-4;
    Не претендую на "хорошесть" словарика. В моем случае и такой пойдет,
    вы всегда сможете добавить свои символы и даже слова. Только
    это нужно делать в обоих списках, иначе будет ошибка.
    """
    # Слоаврь с заменами
    slovar = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e','ё':'yo',
        'ж':'zh','з':'z','и':'i','й':'y','к':'k','л':'l','м':'m','н':'n',
        'о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'kh',
        'ц':'c','ч':'cz','ш':'sh','щ':'scz','ъ':'\'','ы':'y','ь':'\'','э':'e',
        'ю':'u','я':'ja', 'А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Ё':'E',
        'Ж':'ZH','З':'Z','И':'I','Й':'I','К':'K','Л':'L','М':'M','Н':'N',
        'О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'KH',
        'Ц':'C','Ч':'CZ','Ш':'SH','Щ':'SCH','Ъ':'\'','Ы':'y','Ь':'','Э':'E',
        'Ю':'U','Я':'YA',',':'','?':'',' ':' ','~':'','!':'','@':'','#':'',
        '$':'','%':'','^':'','&':'','*':'','(':'',')':'','-':'','=':'','+':'',
        ':':'',';':'','<':'','>':'','\'':'','"':'','\\':'','/':'','№':'',
        'і': 'i', 'І': "I",
        '[':'',']':'','{':'','}':'','ґ':'g','ї':'yi', 'є':'ye','Ґ':'G','Ї':'YI',
        'Є':'YE', '—':''}
            
    # Циклически заменяем все буквы в строке
    for key in slovar:
        name = name.replace(key, slovar[key])
    return emoji.demojize(name)

def trim(string, length):
    return (string[:length] + '..') if len(string) > length-2 else string